# Connection to SQL Laboratory

We are going to import the libraries needed to connect with MySQL.

First, we need to install the MySQL connector:

In [ ]:
!pip install mysql-connector-python

In [ ]:
!pip install sqlalchemy

Then we will use the library sqlalchemy to establish the connection to our engine.

Pandas will be needed to transform tables into dataframes and vice-versa.

In [1]:
from sqlalchemy import create_engine, text
import pandas as pd

## Setting up the connection string

In [20]:
# connection string parameters
# these are the parameters to acess MY server
# in case of running MySQL locally, the user and password are the ones you defined
username='USERNAME' # if running locally, the default user is root
password='PWD'
# the host must be an IP address or DNS
# if local: localhost
host='IP' # my server public IP address
port= 'PORT'

# create connection string
connStr='mysql+mysqlconnector://'+username+':'+password+'@'+host+':'+port+'/classicmodels'
print(connStr)

# instantiate engine
engine=create_engine(connStr)
# connect to server
conn=engine.connect()

mysql+mysqlconnector://nuclio-user:nuclio-password@167.99.211.200:3306/classicmodels

# Execute SQL queries

In [3]:
# show server databases
sql_query = 'SHOW DATABASES'
res=conn.execute(text(sql_query))

# display execution results
res.fetchall()

[('classicmodels',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',)]

In [4]:
res.rowcount

4

# conectando ao bd classicmodels

In [4]:
conn.execute(text('USE classicmodels'))

# Pegando Tabelas

# Mostrando tabelas

In [10]:
df_tabelas = pd.read_sql(text('SHOW TABLES'), conn)
df_tabelas

  Tables_in_classicmodels
0               customers
1               employees
2                 offices
3            orderdetails
4                  orders
5                payments
6            productlines
7                products
8                 reviews
9             reviews_sql

In [12]:
path_schema = './schema/'
path_tables = './tables/'

# Salvando Schemas

In [13]:
df_tabelas.to_csv(path_schema+'classic_model_tables.csv', index = False)

# salvando schema de determinada tabela

In [23]:
table = 'customers'
pd.read_sql(text(f'DESC {table}'),conn)

                     Field           Type Null  Key Default Extra
0           customerNumber            int   NO  PRI    None
1             customerName    varchar(50)   NO         None
2          contactLastName    varchar(50)   NO         None
3         contactFirstName    varchar(50)   NO         None
4                    phone    varchar(50)   NO         None
5             addressLine1    varchar(50)   NO         None
6             addressLine2    varchar(50)  YES         None
7                     city    varchar(50)   NO         None
8                    state    varchar(50)  YES         None
9               postalCode    varchar(15)  YES         None
10                 country    varchar(50)   NO         None
11  salesRepEmployeeNumber            int  YES  MUL    None
12             creditLimit  decimal(10,2)  YES         None

In [24]:
for table in df_tabelas['Tables_in_classicmodels']:
    print('saving', table)
    try:
        df =pd.read_sql(text(f'DESC {table}'), conn)
        df.to_csv(path_schema+f'{table}.csv', index=False)   
    except Exception as error:
        print("erro :", error)

saving customers
saving employees
saving offices
saving orderdetails
saving orders
saving payments
saving productlines
saving products
saving reviews
saving reviews_sql

# Salvando Tabelas

In [26]:
for table in df_tabelas['Tables_in_classicmodels']:
    print('saving table', table)
    try:
        df =pd.read_sql(text(f'SELECT * FROM {table}'), conn)
        df.to_csv(path_tables+f'{table}.csv', index=False)   
    except Exception as error:
        print("erro :", error)

saving table customers
saving table employees
saving table offices
saving table orderdetails
saving table orders
saving table payments
saving table productlines
saving table products
saving table reviews
saving table reviews_sql